<template>
  <transition name="zxl" appear>
    <div class="main">
      <aplayer
        theme="#41b883"
        listFolded="false"
        :music="music[0]"
        :list="music"
        src="src"
        pic="pic"
        :showLrc="true"
      ></aplayer>
    </div>
  </transition>
</template>

<script>
import aplayer from "vue-aplayer";
export default {
  components: { aplayer },
  data() {
    return {
      music: [
        {
          src: "http://music.163.com/song/media/outer/url?id=1804200089",
          title: "忘れない為に",
          artist: "Dear*ポラリス",
          pic: "http://p1.music.126.net/noP7Y3V0ntYZYWQTTi0--w==/109951165539837900.jpg?param=130y130",
          lrc: "[00:36.480]境界の向こうに落とした きっと 大切な何かを一定是 把重要的什么给遗落在境界的对岸\n[00:54.244]どんな言葉があるの会有怎样的话语呢\n[00:57.196]知り得るもの全部教えて你把所能知道的事情全部告诉我\n[01:01.898]どんな顔で笑うの是用怎样的表情微笑呢\n[01:05.659]こっそりこっちを見てよ瞧瞧看向这边哦\n[01:12.582]ねえ 初めてくれた涙呐 你最初为我而流的眼泪\n[01:17.571]私のココロ満たした填满了我的心田\n[01:22.534]未来の約束 覚えてる有关未来的约定 你还记得吗\n[01:30.110]小指と小指を絡めてくれた あなたを待つよ小指与小指相互缠绕 我会等你哦\n[01:39.122]いつまでも直到地老天荒\n[01:58.844]胸懐の向こうに仕舞った ずっと 大切な記憶を一直 将很珍视的记忆\n[02:16.425]あの森で遊ぼうよ在那片森林里玩耍吧\n[02:19.821]その次はもっと遠くの街下次就去更远的街道\n[02:24.706]明日また会えるかな明天还能见到你吗\n[02:28.232]それだけで幸せだよ仅此就很幸福了啊\n[02:33.300]ねえ 最後にくれた涙呐 你最后为我而流的眼泪\n[02:37.767]私のココロ痛めた让我心痛难忍\n[02:42.652]未来の約束は消えたの?有关未来的约定难道消失了吗？\n[02:50.332]時間が流れて 遥かな距離を漂うアリア时光流逝 飘荡了遥远距离的咏叹调\n[02:59.579]聴こえない我已听不见\n[03:19.406]ねえ 初めてくれた涙呐 你最初为我而流的眼泪\n[03:24.317]私のココロ満たした填满了我的心田\n[03:29.202]未来の約束 信じてる相信着 有关未来的约定\n[03:37.039]あなたの描いた線の上には命の続き你所描绘的线上是生命的延续\n[03:46.234]歩いているよ我一直不断行走\n[03:49.551]裂けた空の継ぎめから从撕裂的天空的裂缝处\n[03:54.097]明日は何度も生まれている明天将无数次诞生\n[03:59.060]どこかにいるなら 笑っていてね如果你还在某处 请记得微笑\n[04:07.471]今度会えたら下次再见到你\n[04:10.084]もう一度約束をしよう再一次做个约定吧\n[04:15.804]指きりで小指拉钩",
        },
        {
          src: "http://music.163.com/song/media/outer/url?id=421934059",
          title: "忘れない為に",
          artist: "夏萝",
          pic: "http://p2.music.126.net/QNtPAYlwXVN4LGCHGzp4hw==/17843974207490293.jpg?param=130y130",
          lrc: "[ti:忘れない為に]\n[ar:夏萝]\n[00:36.20]境界の向こうに落とした\n[00:45.38]きっと 大切な何かを\n[00:53.01]\n[00:53.70]どんな言葉があるの\n[00:57.12]知り得るもの全部教えて\n[01:01.98]どんな顔で笑うの\n[01:05.47]こっそりこっちを見てよ\n[01:10.98]\n[01:12.30]れえ 初めてくれた涙\n[01:17.20]私のココロ満たした\n[01:22.14]未来の約束 覚えてる\n[01:29.57]小指と小指を絡めてくれた あなたを待つよ\n[01:39.15]いつまでも\n[01:44.70]\n[01:58.74]胸懷の向こうに仕舞った\n[02:07.93]ずっと 大切な記憶を\n[02:15.41]\n[02:16.12]あの森で遊ぽうよ\n[02:19.58]その次はもっと遠くの街\n[02:24.57]明日また会えるかな\n[02:28.01]それだけで幸せだよ\n[02:32.22]\n[02:33.03]れえ 最後にくれた涙\n[02:37.64]私のココロ痛めた\n[02:42.58]未来の約束は消えたの?\n[02:50.16]時間が流れて 遥かな距離を漂うアリア\n[02:59.49]聴こえない\n[03:04.57]\n[03:19.53]れえ 初めてくれた涙\n[03:24.35]私のココロ満たした\n[03:29.14]未来の約束 信じてる\n[03:36.71]あなたの描いた線の上には命の続き\n[03:46.22]歩いているよ\n[03:48.43]\n[03:49.14]裂けた空の継ぎめから\n[03:53.77]明日は何度も生まれている\n[03:58.85]どこかにいるなら 笑っていてね\n[04:07.39]今度会えたら\n[04:09.84]もう一度約束をしよう\n[04:15.77]指きりで\n[04:21.54]",
        },
        {
          src: "https://m801.music.126.net/20230510154619/c06ff98c39445719ce57cc1b3dd2777a/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/25134701555/0033/2f11/78f5/e487514a9c14e4a23fe89cd18e0a40f5.mp3",
          title: "落泪",
          artist: "康熙/TOYOKI",
          pic: "http://p2.music.126.net/QNtPAYlwXVN4LGCHGzp4hw==/17843974207490293.jpg?param=130y130",
          lrc: "[ti:忘れない為に]\n[ar:夏萝]\n[00:36.20]境界の向こうに落とした\n[00:45.38]きっと 大切な何かを\n[00:53.01]\n[00:53.70]どんな言葉があるの\n[00:57.12]知り得るもの全部教えて\n[01:01.98]どんな顔で笑うの\n[01:05.47]こっそりこっちを見てよ\n[01:10.98]\n[01:12.30]れえ 初めてくれた涙\n[01:17.20]私のココロ満たした\n[01:22.14]未来の約束 覚えてる\n[01:29.57]小指と小指を絡めてくれた あなたを待つよ\n[01:39.15]いつまでも\n[01:44.70]\n[01:58.74]胸懷の向こうに仕舞った\n[02:07.93]ずっと 大切な記憶を\n[02:15.41]\n[02:16.12]あの森で遊ぽうよ\n[02:19.58]その次はもっと遠くの街\n[02:24.57]明日また会えるかな\n[02:28.01]それだけで幸せだよ\n[02:32.22]\n[02:33.03]れえ 最後にくれた涙\n[02:37.64]私のココロ痛めた\n[02:42.58]未来の約束は消えたの?\n[02:50.16]時間が流れて 遥かな距離を漂うアリア\n[02:59.49]聴こえない\n[03:04.57]\n[03:19.53]れえ 初めてくれた涙\n[03:24.35]私のココロ満たした\n[03:29.14]未来の約束 信じてる\n[03:36.71]あなたの描いた線の上には命の続き\n[03:46.22]歩いているよ\n[03:48.43]\n[03:49.14]裂けた空の継ぎめから\n[03:53.77]明日は何度も生まれている\n[03:58.85]どこかにいるなら 笑っていてね\n[04:07.39]今度会えたら\n[04:09.84]もう一度約束をしよう\n[04:15.77]指きりで\n[04:21.54]",
        },
        {
          src: "http://music.163.com/song/media/outer/url?id=1974443814",
          title: "我记得",
          artist: "赵雷",
          pic: "https://p4.music.126.net/FCWD6ibS2JK2B3QAnXuzwQ==/109951167805892385.jpg",
          lrc: "[00:28.15]我带着比身体重的行李 游入尼罗河底  经过几道闪电  看到一堆光圈 不确定是不是这里\n[00:41.78]我看到几个人站在一起 他们拿着剪刀摘走我的行李 擦拭我的脑袋 没有机会返回去\n[00:54.05]\n[00:55.87]直到我听见一个声音 我确定是你\n[01:04.13]可你怎记得我\n[01:09.20]我带来了另界的消息 可我怎么告知你\n[01:17.94]注定失忆着相遇\n[01:22.15]\n[01:23.39]我记得这里是片树林 后面有个山坡 山坡上的枣树每当秋天到来 我们把枣装满口袋\n[01:37.27]我记得除了朋友我还 做过你的叔父 你总喜欢跟在我的屁股后面 只是为了那几个铜钱\n[01:50.96]我记得我们曾是恋人 后来战争爆发 你上战场后就再也没有回来 直到收不到你的信\n[02:04.54]我们总这样重复分离 却要重新开始 相互送别对方 说着来世再见 再次失忆着相聚\n[02:16.84]\n[02:18.54]呜 呜 呜 呜…\n[02:23.35]快来抱抱 快来抱抱我\n[02:31.68]呜 呜 呜 呜…\n[02:34.03]快来抱抱 快来抱抱我\n[02:41.30]\n[03:13.15]在路上我遇到了一位故去多年的人 她是如此年轻 扎着过肩马尾 露出和你一样的笑\n[03:26.78]她和我讲了很多关于你成长的故事 在星空另一端 思念从未停止 如同墓碑上的名字\n[03:39.23]\n[03:40.58]不要哭我最亲爱的人 我最好的玩伴 时空是个圆圈 直行或是转弯 我们最终都会相见\n[03:54.13]在城池的某个拐角处 在夕阳西下时 在万家灯火的某一扇窗纱里 人们失忆着相聚\n[04:06.47]\n[04:08.47]呜 快来抱抱 快来抱抱我\n[04:21.62]呜 快来抱抱 快来抱抱我 我终于找到你\n[05:03.42]呜 快来抱抱 快来抱抱我 我终于找到你\n[05:16.10]\n[05:18.08]",
        },
        {
          src: "http://music.163.com/song/media/outer/url?id=1808492017",
          title: "错位时空",
          artist: "艾辰",
          pic: "http://p3.music.126.net/8C0lwLE88j9ZwLyPQ9a4FA==/109951165595770076.jpg",
          lrc: "[00:12.51]OP：腾煌星象\n[00:13.51]出品：网易飓风\n[00:15.50]填不满半排观众的电影\n[00:19.12]直到散场时突然亮起灯\n[00:23.03]字幕定格在某某出品和发行\n[00:26.30]我目送 他们行色匆匆\n[00:29.88]像个自不量力的复读生\n[00:33.45]完不成金榜题名的使命\n[00:37.28]命不是猜剪刀石头布的决定\n[00:41.03]那么任性\n[00:44.52]我吹过你吹过的晚风\n[00:48.12]那我们算不算 相拥\n[00:51.73]可如梦初醒般的两手空空\n[00:55.34]心也空\n[00:58.90]我吹过你吹过的晚风\n[01:02.50]是否看过同样 风景\n[01:06.10]像扰乱时差留在错位时空\n[01:09.67]终是空 是空\n[01:30.88]数不完见证许愿的繁星\n[01:34.31]没灵验谁来安慰坏心情\n[01:38.23]十字路口闪烁不停的信号灯\n[01:41.49]有个人 显然心事重重\n[01:45.11]三个字 只能说给自己听\n[01:48.64]仰着头不要让眼泪失控\n[01:52.50]哪里有可以峰回路转的宿命\n[01:56.22]我不想听\n[01:59.80]我吹过你吹过的晚风\n[02:03.36]那我们算不算 相拥\n[02:07.00]可如梦初醒般的两手空空\n[02:10.56]心也空\n[02:13.93]我吹过你吹过的晚风\n[02:17.73]是否看过同样 风景\n[02:21.36]像扰乱时差留在错位时空\n[02:24.84]终是空 是空\n[02:32.10]我吹过你吹过的晚风\n[02:35.65]空气里弥漫着 心痛\n[02:39.23]可我们 最后 在这错位时空\n[02:42.90]终成空\n[02:46.45]我吹过你吹过的晚风\n[02:49.95]空气里弥漫着 心痛\n[02:53.55]可我们 最后 在这错位时空\n[02:57.13]终成空 成空\n[03:02.51]\n[03:04.51]分轨混音：何世渝\n[03:06.51]贝斯：谭玮\n[03:07.51]吉他：望雷\n[03:08.51]监制/统筹：孙斌@子文沐凡\n[03:09.51]贴唱/和声：沙栩帆\n[03:11.51]企划：丁柏昕/袁晓童\n[03:12.51]宣发：徐思灵/苏琦惠\n[03:13.51]出品人：谢奇笛/凌联兴\n[03:14.51]本歌曲来自〖飓风计划〗\n[03:15.51]10亿现金激励，千亿流量扶持！\n[03:16.51]业务联系：jf399@vip.163.com\n\n\n",
        },
        {
          title: "起风了",
          src: "http://music.163.com/song/media/outer/url?id=1330348068",
          pic: "http://p4.music.126.net/diGAyEmpymX8G7JcnElncQ==/109951163699673355.jpg",
          artist: "买辣椒也用券",
          lrc: "[00:25.237]这一路上走走停停\n[00:28.592]顺着少年漂流的痕迹\n[00:31.681]迈出车站的前一刻\n[00:34.795]竟有些犹豫\n[00:37.794]不禁笑这近乡情怯\n[00:41.191]仍无可避免\n[00:43.819]而长野的天\n[00:45.134]依旧那么暖\n[00:46.684]风吹起了从前\n[00:49.153]从前初识这世间\n[00:52.185]万般流连\n[00:53.962]看着天边似在眼前\n[00:56.798]也甘愿赴汤蹈火去走它一遍\n[01:01.966]如今走过这世间\n[01:05.001]万般流连\n[01:06.632]翻过岁月不同侧脸\n[01:09.861]措不及防闯入你的笑颜\n[01:15.513]我曾难自拔于世界之大\n[01:19.605]也沉溺于其中梦话\n[01:22.837]不得真假 不做挣扎 不惧笑话\n[01:28.501]我曾将青春翻涌成她\n[01:31.930]也曾指尖弹出盛夏\n[01:35.281]心之所动 且就随缘去吧\n[01:41.156]逆着光行走 任风吹雨打\n[01:58.028]短短的路走走停停\n[02:01.171]也有了几分的距离\n[02:04.236]不知抚摸的是故事 还是段心情\n[02:10.711]也许期待的不过是 与时间为敌\n[02:16.193]再次看到你\n[02:17.991]微凉晨光里\n[02:19.556]笑得很甜蜜\n[02:22.116]从前初识这世间\n[02:24.937]万般流连\n[02:26.663]看着天边似在眼前\n[02:29.616]也甘愿赴汤蹈火去走它一遍\n[02:34.711]如今走过这世间\n[02:37.657]万般流连\n[02:39.389]翻过岁月不同侧脸\n[02:42.360]措不及防闯入你的笑颜\n[02:48.265]我曾难自拔于世界之大\n[02:52.336]也沉溺于其中梦话\n[02:55.538]不得真假 不做挣扎 不惧笑话\n[03:01.140]我曾将青春翻涌成她\n[03:05.235]也曾指尖弹出盛夏\n[03:08.062]心之所动 且就随缘去吧\n[03:39.324]晚风吹起你鬓间的白发\n[03:43.574]抚平回忆留下的疤\n[03:46.788]你的眼中 明暗交杂 一笑生花\n[03:52.294]暮色遮住你蹒跚的步伐\n[03:56.330]走进床头藏起的画\n[03:59.544]画中的你 低着头说话\n[04:05.074]我仍感叹于世界之大\n[04:08.784]也沉醉于儿时情话\n[04:12.150]不剩真假 不做挣扎 无谓笑话\n[04:17.925]我终将青春还给了她\n[04:21.677]连同指尖弹出的盛夏\n[04:25.007]心之所动 就随风去了\n[04:30.601]以爱之名 你还愿意吗\n[04:38.541]\n",
        },
      ],
    };
  },
};
</script>

<style lang="less" scoped>
* {
  margin: 0;
  padding: 0;
}
.main {
  width: 100%;
  height: 100px;
}
.zxl-enter-active {
  animation: zxl 0.5s linear;
}

.zxl-leave-active {
  animation: zxl 0.5s linear reverse;
}
.aplayer {
  width: 100%;
  height: auto;
  margin-left: -0px;
}

@keyframes zxl {
  0% {
    transform: translateY(100%);
  }
  100% {
    transform: translateY(0px);
  }
}
</style>
